zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/source/gd32c2x1_fmc.c
            /* start page erase */
            FMC_CTL |= FMC_CTL_START;

            /* wait for the FMC ready */
            fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

            FMC_CTL &= ~FMC_CTL_PER;
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      erase whole chip (API_ID(0x000CU))
    \param[in]  none
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_OBERR: option byte read error
      \arg        FMC_RPERR: read protection error
      \arg        FMC_FSTPERR: fast programming error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: timeout error
*/
fmc_state_enum fmc_mass_erase(void)
{
    fmc_state_enum fmc_state;

    /* wait for the FMC ready */
    fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        /* start chip erase */
        FMC_CTL |= FMC_CTL_MER;
        FMC_CTL |= FMC_CTL_START;

        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

        /* reset the MER bit */
        FMC_CTL &= ~FMC_CTL_MER;
    }
    /* return the fmc state */
    return fmc_state;
}

/*!
    \brief      program a double word at the given address in main flash (API_ID(0x000DU))
    \param[in]  address: address to program
    \param[in]  data: double word to program
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_OBERR: option byte read error
      \arg        FMC_RPERR: read protection error
      \arg        FMC_FSTPERR: fast programming error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_UNDEFINEDERR: undefined error for function input parameter checking
*/
fmc_state_enum fmc_doubleword_program(uint32_t address, uint64_t data)
{
    uint32_t data0, data1;
    fmc_state_enum fmc_state;
#ifdef FW_DEBUG_ERR_REPORT
    if((address % 8U) != 0U) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000DU), ERR_PARAM_OUT_OF_RANGE);
        fmc_state = FMC_UNDEFINEDERR;
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        
        data0 = (uint32_t)(data & 0xFFFFFFFFU);
        data1 = (uint32_t)((data >> 32U) & 0xFFFFFFFFU);
        
        if(FMC_READY == fmc_state) {
            /* set the PG bit to start program */
            FMC_CTL |= FMC_CTL_PG;
            REG32(address) = data0;
            REG32(address + 4U) = data1;
        
            /* wait for the FMC ready */
            fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        
            /* reset the PG bit */
            FMC_CTL &= ~FMC_CTL_PG;
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      fast program a row at the corresponding address (API_ID(0x000EU))
    \param[in]  address: address to program
    \param[in]  data_buf: data buffer to program
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_OBERR: option byte read error
      \arg        FMC_RPERR: read protection error
      \arg        FMC_FSTPERR: fast programming error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_UNDEFINEDERR: undefined error for function input parameter checking
*/
fmc_state_enum fmc_fast_program(uint32_t address, uint32_t data_buf)
{
    uint8_t index;
    fmc_state_enum fmc_state;
#ifdef FW_DEBUG_ERR_REPORT
    if((address % 16U) != 0U) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x000EU), ERR_PARAM_OUT_OF_RANGE);
        fmc_state = FMC_UNDEFINEDERR;
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        
        if(FMC_READY == fmc_state) {
            /* set the FSTPG bit to start program */
            FMC_CTL |= FMC_CTL_FSTPG;
        
            /* program the row data */
            for(index = 0U; index < DOUBLEWORD_CNT_IN_ROW; index++) {
                REG32(address) = REG32(data_buf);
                REG32(address + 4U) = REG32(data_buf + 4U);
                address += 8U;
                data_buf += 8U;
            }
        
            /* wait for the FMC ready */
            fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        
            /* reset the FSTPG bit */
            FMC_CTL &= ~FMC_CTL_FSTPG;
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      enable debugger (API_ID(0x000FU))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_debugger_enable(void)
{
    FMC_WS |= FMC_WS_DBGEN;
}

/*!
  * \brief      disable debugger (API_ID(0x0010U))
    \param[in]  none
    \param[out] none
    \retval     none
  */
void fmc_debugger_disable(void)
{
    FMC_WS &= ~FMC_WS_DBGEN;
}

/*!
    \brief      enable secure area protection (API_ID(0x0011U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void fmc_scr_area_enable(void)
{
    FMC_CTL |= FMC_CTL_SCR;
}

/*!
    \brief      unlock the option bytes operation (API_ID(0x0012U))
                it is better to used in pairs with ob_lock
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_unlock(void)
{
    if(0U != (FMC_CTL & FMC_CTL_OBLK)) {
        /* write the FMC ob unlock key */
        FMC_OBKEY = OB_UNLOCK_KEY0;
        FMC_OBKEY = OB_UNLOCK_KEY1;
    }
}

/*!
    \brief      lock the option bytes operation (API_ID(0x0013U))
                it is better to used in pairs with ob_unlock after an operation
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_lock(void)
{
    /* reset the OBWEN bit */
    FMC_CTL &= ~FMC_CTL_OBLK;
}

/*!
    \brief      reload the option bytes operation (API_ID(0x0014U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void ob_reload(void)
{
    /* set the OBRLD bit */
    FMC_CTL |= FMC_CTL_OBRLD;
}

/*!
    \brief      program the option bytes USER (API_ID(0x0015U))
                programmer must ensure FMC & option bytes are both unlocked before calling this function
                this function can only clear the corresponding bits to be 0 rather than 1.
    \param[in]  ob_user: user option bytes. When write one parameter, the corresponding mask should be set.
                one or more (bitwise OR) parameters can be selected which are shown as below:
      \arg        OB_NRST_PIN_INPUT_MODE/OB_NRST_PIN_NORMAL_GPIO/OB_NRST_PIN_INPUT_OUTPUT_MODE: reset pin mode
      \arg        OB_NBOOT0_VALUE_0/OB_NBOOT0_VALUE_1: boot0 value 0 or value 1
      \arg        OB_NBOOT1_VALUE_0/OB_NBOOT1_VALUE_1: boot1 value 0 or value 1
      \arg        OB_SWBOOT0_FROM_OB_BOOT0/OB_SWBOOT0_FROM_PIN: boot by option byte value or by PB8/BOOT0 pin
      \arg        OB_SRAM_PARITY_CHECK_ENABLE/OB_SRAM_PARITY_CHECK_DISABLE: SRAM parity check enable configuration
      \arg        OB_SRAM_ECC_ENABLE/OB_SRAM_ECC_DISABLE: SRAM ECC enable configuration
      \arg        OB_HXTAL_REMAP_ENABLE/OB_HXTAL_REMAP_DISABLE: HXTAL remapping
      \arg        OB_WWDGT_HW/OB_WWDGT_SW: hardware or software window watchdog timer
      \arg        OB_FWDGT_HW/OB_FWDGT_SW: hardware or software free watchdog timer
      \arg        OB_STDBY_RST/OB_STDBY_NRST: reset or not entering standby mode
      \arg        OB_DEEPSLEEP_RST/OB_DEEPSLEEP_NRST: reset or not entering deep sleep mode
      \arg        OB_BORR_TH_VALUE0/OB_BORR_TH_VALUE1/OB_BORR_TH_VALUE2/OB_BORR_TH_VALUE3: BOR rising threshold value
      \arg        OB_BORF_TH_VALUE0/OB_BORF_TH_VALUE1/OB_BORF_TH_VALUE2/OB_BORF_TH_VALUE3: BOR falling threshold value
      \arg        OB_BORST_DISABLE/OB_BORST_ENABLE: BOR reset configuration
    \param[in]  ob_user_mask: user bits mask. They correspond to the above parameter value one by one.
                  one or more (bitwise OR) parameters can be selected which are shown as below:
      \arg        FMC_OBCTL_NRST_MDSEL: reset pin mode bit mask
      \arg        FMC_OBCTL_NBOOT0: NBOOT0 option bit mask
      \arg        FMC_OBCTL_NBOOT1: NBOOT1 option bit mask
      \arg        FMC_OBCTL_SWBT0: software BOOT0 bit mask
      \arg        FMC_OBCTL_SRAM_ECC_EN: SRAM ECC disable bit mask
      \arg        FMC_OBCTL_HXTAL_REMAP: HXTAL remapping bit mask
      \arg        FMC_OBCTL_NWWDG_HW: window watchdog configuration bit mask
      \arg        FMC_OBCTL_NFWDG_HW: free watchdog configuration bit mask
      \arg        FMC_OBCTL_NRST_STDBY: option byte standby reset bit mask
      \arg        FMC_OBCTL_NRST_DPSLP: option byte deepsleep reset bit mask
      \arg        FMC_OBCTL_BORR_TH: BORR threshold bits mask
      \arg        FMC_OBCTL_BORF_TH: BORF threshold bits mask
      \arg        FMC_OBCTL_BORST_EN: brown out reset bit mask
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_OBERR: option byte read error
      \arg        FMC_RPERR: read protection error
      \arg        FMC_FSTPERR: fast programming error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: high security protection
      \arg        FMC_UNDEFINEDERR: undefined error for function input parameter checking
*/
fmc_state_enum ob_user_write(uint32_t ob_user, uint32_t ob_user_mask)
{
    uint32_t obctl_reg;
    fmc_state_enum fmc_state = FMC_UNDEFINEDERR;
#ifdef FW_DEBUG_ERR_REPORT
    /* ob_user_mask is not supported */
    if(NOT_FMC_OB_USER_MASK(ob_user_mask)){
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    /* ob_user doesn't match ob_user_mask */
    } else if( 0u != (ob_user & (~ob_user_mask))){
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* check the option bytes security protection value */
        if(FMC_HSPC == (FMC_OBCTL & FMC_OBCTL_SPC)) {
            fmc_state =  FMC_OB_HSPC;
        } else {
            /* wait for the FMC ready */
            fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
            
            if(FMC_READY == fmc_state) {
                obctl_reg = FMC_OBCTL;
                FMC_OBCTL = (obctl_reg & (~ob_user_mask)) | ob_user;
                FMC_CTL |= FMC_CTL_OBSTART;
                /* wait for the FMC ready */
                fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
            }
        }
    }
    return fmc_state;
}

/*!
    \brief      configure security protection level (API_ID(0x0016U))
                programmer must ensure FMC & option bytes are both unlocked before calling this function
    \param[in]  ob_spc: specify security protection
                only one parameter can be selected which is shown as below:
      \arg        FMC_NSPC: no security protection
      \arg        FMC_LSPC: low security protection
      \arg        FMC_HSPC: high security protection
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_OBERR: option byte read error
      \arg        FMC_RPERR: read protection error
      \arg        FMC_FSTPERR: fast programming error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: high security protection
*/
fmc_state_enum ob_security_protection_level_config(uint8_t ob_spc)
{
    uint32_t obctl_reg;
    fmc_state_enum fmc_state;

    /* wait for the FMC ready */
    fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);

    if(FMC_READY == fmc_state) {
        obctl_reg = FMC_OBCTL;

