zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/source/gd32c2x1_fmc.c
        /* reset the SPC, set according to ob_spc */
        obctl_reg &= ~FMC_OBCTL_SPC;
        obctl_reg |= (uint32_t)ob_spc;
        FMC_OBCTL = obctl_reg;
        FMC_CTL |= FMC_CTL_OBSTART;

        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure the option bytes DCRP area (API_ID(0x0017U))
    \param[in]  dcrp_area: DCRP area
                only one parameter can be selected which is shown as below:
      \arg        DCRP_AREA_0: the DCRP area 0
      \arg        DCRP_AREA_1: the DCRP area 1
    \param[in]  dcrp_eren: DCRP area erase enable bit
      \arg        OB_DCRP_AREA_ERASE_DISABLE: DCRP area is not erased when low security protection to no security protection
      \arg        OB_DCRP_AREA_ERASE_ENABLE: DCRP area is erased when low security protection to no security protection
    \param[in]  dcrp_start: the first page offset of the DCRP area
    \param[in]  dcrp_end: the last page offset of the DCRP area
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_OBERR: option byte read error
      \arg        FMC_RPERR: read protection error
      \arg        FMC_FSTPERR: fast programming error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: high security protection
      \arg        FMC_UNDEFINEDERR: undefined error for function input parameter checking
*/
fmc_state_enum ob_dcrp_area_config(uint32_t dcrp_area, uint32_t dcrp_eren, uint32_t dcrp_start,
                                   uint32_t dcrp_end)
{
    uint32_t reg_value;
    fmc_state_enum fmc_state;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_FMC_DCRP_AREA_VALID_CFG(dcrp_area,dcrp_eren,dcrp_start,dcrp_end)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0017U), ERR_PARAM_OUT_OF_RANGE);
        fmc_state = FMC_UNDEFINEDERR;
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* check the option bytes security protection value */
        if(FMC_HSPC == (FMC_OBCTL & FMC_OBCTL_SPC)) {
            fmc_state = FMC_OB_HSPC;
        } else {
            /* wait for the FMC ready */
            fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
            
            if(FMC_READY == fmc_state) {
                /* configure DCRP area */
                if(DCRP_AREA_0 == dcrp_area) {
                    FMC_DCRP_SADDR0 = dcrp_start << DCRP_SADDR_OFFSET;
                    reg_value = FMC_DCRP_EADDR0;
                    reg_value &= ~FMC_DCRP_EADDR0_DCRP_EREN;
                    reg_value &= ~FMC_DCRP_EADDR0_DCRP0_EADDR;
                    reg_value |= (dcrp_end << DCRP_EADDR_OFFSET);
                    FMC_DCRP_EADDR0 = reg_value;
                } else{
                    FMC_DCRP_SADDR1 = dcrp_start << DCRP_SADDR_OFFSET;
                    FMC_DCRP_EADDR1 = dcrp_end << DCRP_EADDR_OFFSET;
                }
            
                /* configure EREN */
                reg_value = FMC_DCRP_EADDR0;
                reg_value &= ~FMC_DCRP_EADDR0_DCRP_EREN;
                reg_value |= dcrp_eren;
                FMC_DCRP_EADDR0 = reg_value;
            
                /* set the OBSTART bit in FMC_CTL register */
                FMC_CTL |= FMC_CTL_OBSTART;
            
                /* wait for the FMC ready */
                fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure the option bytes write protection area (API_ID(0x0018U))
    \param[in]  wp_area: write protection area
                only one parameter can be selected which is shown as below:
      \arg        WP_AREA_0: the first area
      \arg        WP_AREA_1: the second area
    \param[in]  wp_start: first page of write protection area
    \param[in]  wp_end: last page of write protection area
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_OBERR: option byte read error
      \arg        FMC_RPERR: read protection error
      \arg        FMC_FSTPERR: fast programming error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: high security protection
      \arg        FMC_UNDEFINEDERR: undefined error for function input parameter checking
*/
fmc_state_enum ob_write_protection_area_config(uint32_t wp_area, uint32_t wp_start, uint32_t wp_end)
{
    uint32_t value;
    fmc_state_enum fmc_state;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_FMC_WP_AREA_VALID_CFG(wp_area,wp_start,wp_end)){
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0018U), ERR_PARAM_OUT_OF_RANGE);
        fmc_state = FMC_UNDEFINEDERR;
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* check the option bytes security protection value */
        if(FMC_HSPC == (FMC_OBCTL & FMC_OBCTL_SPC)) {
            fmc_state =  FMC_OB_HSPC;
        } else 
        {
            /* wait for the FMC ready */
            fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
            if(FMC_READY == fmc_state) {
                value = (wp_start << WP_SADDR_OFFSET) | (wp_end << WP_EADDR_OFFSET);
                /* configure the write protected area */
                if(WP_AREA_0 == wp_area) {
                    FMC_WP0 = value;
                } else {
                    FMC_WP1 = value;
                }
                /* set the OBSTART bit in FMC_CTL register */
                FMC_CTL |= FMC_CTL_OBSTART;
                /* wait for the FMC ready */
                fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
            }
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure the option bytes secure area (API_ID(0x0019U))
    \param[in]  secure_size: size of secure area in page unit
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_OBERR: option byte read error
      \arg        FMC_RPERR: read protection error
      \arg        FMC_FSTPERR: fast programming error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: high security protection
      \arg        FMC_UNDEFINEDERR: undefined error for function input parameter checking
*/
fmc_state_enum ob_scr_area_config(uint32_t secure_size)
{
    uint32_t reg_value;
    fmc_state_enum fmc_state;
#ifdef FW_DEBUG_ERR_REPORT
    if(secure_size > MAIN_FLASH_PAGE_TOTAL_NUM) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x0019U), ERR_PARAM_OUT_OF_RANGE);
        fmc_state = FMC_UNDEFINEDERR;
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* check the option bytes security protection value */
        if(FMC_HSPC == (FMC_OBCTL & FMC_OBCTL_SPC)) {
            fmc_state = FMC_OB_HSPC;
        } else {
            /* wait for the FMC ready */
            fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
            
            if(FMC_READY == fmc_state) {
                /* configure secure area */
                reg_value = FMC_SCR;
                reg_value &= ~FMC_SCR_SCR_PAGE_CNT;
                reg_value |= secure_size << SCR_PAGE_CNT_OFFSET;
                FMC_SCR = reg_value;
            }
            
            /* set the OBSTART bit in FMC_CTL register */
            FMC_CTL |= FMC_CTL_OBSTART;
            
            /* wait for the FMC ready */
            fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        }
    }

    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      configure the option bytes boot lock (API_ID(0x001AU))
    \param[in]  boot_config: boot configuration
                only one parameter can be selected which is shown as below:
      \arg        OB_BOOT_LOCK_FROM_MAIN_FLASH: boot from main flash
      \arg        OB_BOOT_UNLOCK: unlock boot
    \param[out] none
    \retval     state of FMC
      \arg        FMC_READY: the operation has been completed
      \arg        FMC_BUSY: the operation is in progress
      \arg        FMC_OBERR: option byte read error
      \arg        FMC_RPERR: read protection error
      \arg        FMC_FSTPERR: fast programming error
      \arg        FMC_PGSERR: program sequence error
      \arg        FMC_PGMERR: program size error
      \arg        FMC_PGAERR: program alignment error
      \arg        FMC_WPERR: erase/program protection error
      \arg        FMC_PGERR: program error
      \arg        FMC_OPRERR: operation error
      \arg        FMC_TOERR: timeout error
      \arg        FMC_OB_HSPC: high security protection
      \arg        FMC_UNDEFINEDERR: undefined error for function input parameter checking
*/
fmc_state_enum ob_boot_lock_config(uint32_t boot_config)
{
    uint32_t reg_value;
    fmc_state_enum fmc_state;

    /* check the option bytes security protection value */
    if(FMC_HSPC == (FMC_OBCTL & FMC_OBCTL_SPC)) {
        fmc_state = FMC_OB_HSPC;
    } else {
        /* wait for the FMC ready */
        fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        
        if(FMC_READY == fmc_state) {
            reg_value = FMC_SCR;
            reg_value &= ~FMC_SCR_BOOTLK;
            reg_value |= boot_config & FMC_SCR_BOOTLK;
            FMC_SCR = reg_value;
        
            /* set the OBSTART bit in FMC_CTL register */
            FMC_CTL |= FMC_CTL_OBSTART;
        
            /* wait for the FMC ready */
            fmc_state = fmc_ready_wait(FMC_TIMEOUT_COUNT);
        }
    }
    /* return the FMC state */
    return fmc_state;
}

/*!
    \brief      get the value of option bytes USER (API_ID(0x001BU))
    \param[in]  user_data_extract_info:user data extract information which include mask and start bit position
      \arg        OBCTL_USER_DATA_BORST_EN: brown out reset enable mask and it's start bit position
      \arg        OBCTL_USER_DATA_BOR_TH: BOR threshold mask and it's start bit position
      \arg        OBCTL_USER_DATA_BORR_TH: BOR threshold at rising VDD supply mask and it's start bit position
      \arg        OBCTL_USER_DATA_BORF_TH: BOR threshold at falling VDD supply mask and it's start bit position
      \arg        OBCTL_USER_DATA_NRST_DPSLP: option byte deepsleep reset value bit mask and it's start bit position
      \arg        OBCTL_USER_DATA_NRST_STDBY: option byte standby reset value bit mask and it's start bit position
      \arg        OBCTL_USER_DATA_NFWDG_HW: free watchdog configuration bit mask and it's start bit position
      \arg        OBCTL_USER_DATA_NWWDG_HW: window watchdog configuration bit mask and it's start bit position
      \arg        OBCTL_USER_DATA_HXTAL_REMAP: HXTAL remapping bit mask and it's start bit position
      \arg        OBCTL_USER_DATA_SRAM_ECC_EN: SRAM ECC enable bit mask and it's start bit position
      \arg        OBCTL_USER_DATA_SRAM_PARITY_CHECK: SRAM parity check configuration bit mask and it's start bit position
      \arg        OBCTL_USER_DATA_MLT_BND_SEC_EN: Multiple-bonding security enable bit mask and it's start bit position
      \arg        OBCTL_USER_DATA_SWBT0: software BOOT0 bit mask and it's start bit position
      \arg        OBCTL_USER_DATA_NBOOT1: NBOOT1 option bit mask and it's start bit position
      \arg        OBCTL_USER_DATA_NBOOT0: NBOOT0 option bit mask and it's start bit position
      \arg        OBCTL_USER_DATA_NRST_MDSEL: NRST pin mode bit mask and it's start bit position
    \param[out] ob_user_data: the user data
    \retval     state of return user value
      \arg        INVLD_RETURN_VALUE: the area address is invalid
      \arg        VLD_RETURN_VALUE: the area address is valid
*/
uint32_t ob_user_get(ob_user_data_extract_info_enum user_data_extract_info, uint8_t * ob_user_data)
{
    uint32_t ret = INVLD_RETURN_VALUE;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(ob_user_data)){
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x001BU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        /* return the FMC user option bytes value */
        uint32_t user_data_mask = (uint32_t)user_data_extract_info & 0xFFF0U;
        uint8_t  user_data_start_position = (uint8_t)((uint32_t)user_data_extract_info & 0x000FU);
        *ob_user_data = (uint8_t)((FMC_OBCTL & user_data_mask) >> user_data_start_position);
        ret = VLD_RETURN_VALUE;
    }
    return ret;
}

/*!
    \brief      get the value of option bytes security protection level in FMC_OBCTL register (API_ID(0x001CU))
    \param[in]  none
    \param[out] none
    \retval     protection level
      \arg        FMC_NSPC: no protection
      \arg        FMC_LSPC: protection level low
      \arg        FMC_HSPC: protection level high
*/
uint8_t ob_security_protection_level_get(void)
{
    return (uint8_t)((FMC_OBCTL & FMC_OBCTL_SPC) >> OBCTL_SPC_OFFSET);
}

/*!
    \brief      get configuration of DCRP area (API_ID(0x001DU))
    \param[in]  dcrp_area: DCRP area
                only one parameter can be selected which is shown as below:
      \arg        DCRP_AREA_0: the DCRP area 0
      \arg        DCRP_AREA_1: the DCRP area 1
    \param[out] dcrp_erase_option: erase option of DCRP area
    \param[out] dcrp_start: start address of DCRP area
    \param[out] dcrp_end: end address of DCRP area
    \retval     state of address
      \arg        INVLD_RETURN_VALUE: the area address is invalid
      \arg        VLD_RETURN_VALUE: the area address is valid
*/
uint32_t ob_dcrp_area_get(uint32_t dcrp_area, uint32_t *dcrp_erase_option,
                          uint32_t *dcrp_start, uint32_t *dcrp_end)
{
    uint32_t dcrp_area_start, dcrp_area_end;
    uint32_t ret = INVLD_RETURN_VALUE;
#ifdef FW_DEBUG_ERR_REPORT
    if((dcrp_area != DCRP_AREA_0) && (dcrp_area != DCRP_AREA_1)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x001DU), ERR_PARAM_OUT_OF_RANGE);
    } else if((NOT_VALID_POINTER(dcrp_erase_option))    ||
              (NOT_VALID_POINTER(dcrp_start)) ||
              (NOT_VALID_POINTER(dcrp_end))) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x001DU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(DCRP_AREA_0 == dcrp_area) {
            dcrp_area_start = (FMC_DCRP_SADDR0 & FMC_DCRP_SADDR0_DCRP0_SADDR) >> DCRP_SADDR_OFFSET;
            dcrp_area_end = (FMC_DCRP_EADDR0 & FMC_DCRP_EADDR0_DCRP0_EADDR) >> DCRP_EADDR_OFFSET;
        
        } else {
            dcrp_area_start = (FMC_DCRP_SADDR1 & FMC_DCRP_SADDR1_DCRP1_SADDR) >> DCRP_SADDR_OFFSET;
            dcrp_area_end = (FMC_DCRP_EADDR1 & FMC_DCRP_EADDR1_DCRP1_EADDR) >> DCRP_EADDR_OFFSET;
        }
        /* get erase option of DCRP area */
        *dcrp_erase_option = (FMC_DCRP_EADDR0 & FMC_DCRP_EADDR0_DCRP_EREN) >> DCRP_EREN_OFFSET;
        /* get start address and end address of DCRP area */
        *dcrp_start = MAIN_FLASH_BASE_ADDRESS + dcrp_area_start * DCRP_AREA_SUBPAGE_SIZE;
        *dcrp_end = MAIN_FLASH_BASE_ADDRESS + (dcrp_area_end + 1U) * DCRP_AREA_SUBPAGE_SIZE - 1U;
        
        if(dcrp_area_start <= dcrp_area_end) {
            /* the DCRP area is valid */
            ret = VLD_RETURN_VALUE;
        } else {
            /* the DCRP area is invalid */
            ret = INVLD_RETURN_VALUE;
        }
    }
    return ret;
}

/*!
    \brief      get address of write protection area (API_ID(0x001EU))
    \param[in]  wp_area: write protection area
                only one parameter can be selected which is shown as below:
      \arg        WP_AREA_0: write protection area 0
      \arg        WP_AREA_1: write protection area 1
    \param[out] wp_start: start address of write protection area
    \param[out] wp_end: end address of write protection area
    \retval     state of address
      \arg        INVLD_RETURN_VALUE: the area address is invalid
      \arg        VLD_RETURN_VALUE: the area address is valid
*/
uint32_t ob_write_protection_area_get(uint32_t wp_area, uint32_t *wp_start,
                                      uint32_t *wp_end)
{
    uint32_t wp_area_start , wp_area_end ;
    uint32_t ret = INVLD_RETURN_VALUE;
#ifdef FW_DEBUG_ERR_REPORT
    if((wp_area != WP_AREA_0) && (wp_area != WP_AREA_1)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x001EU), ERR_PARAM_OUT_OF_RANGE);
    } else if((NOT_VALID_POINTER(wp_start))    ||
              (NOT_VALID_POINTER(wp_end))) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x001EU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(WP_AREA_0 == wp_area) {
            wp_area_start = (FMC_WP0 & FMC_WP0_WP0_SADDR) >> WP_SADDR_OFFSET;
            wp_area_end = (FMC_WP0 & FMC_WP0_WP0_EADDR) >> WP_EADDR_OFFSET;
        } else {
            wp_area_start = (FMC_WP1 & FMC_WP1_WP1_SADDR) >> WP_SADDR_OFFSET;
            wp_area_end = (FMC_WP1 & FMC_WP1_WP1_EADDR) >> WP_EADDR_OFFSET;
        }
        
        *wp_start = MAIN_FLASH_BASE_ADDRESS + wp_area_start * WP_AREA_SUBPAGE_SIZE;
        *wp_end = MAIN_FLASH_BASE_ADDRESS + (wp_area_end + 1U) * WP_AREA_SUBPAGE_SIZE - 1U;
        
        if(wp_area_start <= wp_area_end) {
            /* the write protected area is valid */
            ret =  VLD_RETURN_VALUE;
        } else {
            /* the write protected area is invalid */
            ret =  INVLD_RETURN_VALUE;
        }
    }
    return ret;
}
/*!
    \brief      get size of secure area (API_ID(0x001FU))
    \param[out] scr_area_byte_cnt: secure area size in byte unit
    \retval     none
*/
uint32_t ob_scr_area_get(uint32_t *scr_area_byte_cnt)
{
    uint32_t scr_area_byte_size;
    uint32_t ret = INVLD_RETURN_VALUE;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(scr_area_byte_cnt)) {
        fw_debug_report_err(FMC_MODULE_ID, API_ID(0x001FU), ERR_PARAM_POINTER);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        scr_area_byte_size = (FMC_SCR & FMC_SCR_SCR_PAGE_CNT) >> SCR_PAGE_CNT_OFFSET;
        *scr_area_byte_cnt = scr_area_byte_size * MAIN_FLASH_PAGE_SIZE;
        ret =  VLD_RETURN_VALUE;
    }
    return ret;
}

/*!
    \brief      get boot lock configuration (API_ID(0x0020U))
    \param[in]  none
    \param[out] none
    \retval     boot configuration
      \arg        OB_BOOT_LOCK_FROM_MAIN_FLASH: boot from main flash
      \arg        OB_BOOT_UNLOCK: unlock boot
*/
uint32_t ob_boot_lock_get(void)
{
    return (uint32_t)(FMC_SCR & FMC_SCR_BOOTLK);
}

/*!
    \brief      get FMC flag status (API_ID(0x0021U))
    \param[in]  flag: FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_FLAG_BUSY: FMC operation is in progress
      \arg        FMC_FLAG_OBERR: option byte read error
      \arg        FMC_FLAG_WPERR: erase/program protection error
      \arg        FMC_FLAG_PGSERR: program sequence error
      \arg        FMC_FLAG_PGMERR: program size error
      \arg        FMC_FLAG_PGAERR: program alignment error
      \arg        FMC_FLAG_FSTPERR: fast programming error
      \arg        FMC_FLAG_RPERR: read protection error
      \arg        FMC_FLAG_PGERR: program error
      \arg        FMC_FLAG_OPRERR: operation error
      \arg        FMC_FLAG_ENDF: FMC end of operation flag error
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_flag_get(uint32_t flag)
{
    FlagStatus status = RESET;
    
    flag &= FMC_FLAG_MASK | FMC_STAT_BUSY;
    if(0U!=(FMC_STAT & flag)) {
        status = SET;
    }

    /* return the state of corresponding FMC flag */
    return status;
}

/*!
    \brief      clear the FMC flag (API_ID(0x0022U))
    \param[in]  flag: FMC flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_FLAG_OBERR: option byte read error
      \arg        FMC_FLAG_WPERR: erase/program protection error
      \arg        FMC_FLAG_PGSERR: program sequence error
      \arg        FMC_FLAG_PGMERR: program size error
      \arg        FMC_FLAG_PGAERR: program alignment error
      \arg        FMC_FLAG_FSTPERR: fast programming error
      \arg        FMC_FLAG_RPERR: read protection error
      \arg        FMC_FLAG_PGERR: program error
      \arg        FMC_FLAG_OPRERR: operation error
      \arg        FMC_FLAG_ENDF: FMC end of operation flag error
    \param[out] none
    \retval     none
*/
void fmc_flag_clear(uint32_t flag)
{
    /* clear the flags */
    FMC_STAT = flag & FMC_FLAG_MASK;
}

/*!
    \brief      enable FMC interrupt (API_ID(0x0023U))
    \param[in]  interrupt: the FMC interrupt
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_END: FMC end of operation interrupt
      \arg        FMC_INT_ERR: FMC error interrupt
      \arg        FMC_INT_RPERR: read protection error interrupt
    \param[out] none
    \retval     none
*/
void fmc_interrupt_enable(uint32_t interrupt)
{
    FMC_CTL |= interrupt & FMC_INTERRUPT_CFG_MASK;
}

/*!
    \brief      disable FMC interrupt (API_ID(0x0024U))
    \param[in]  interrupt: the FMC interrupt
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_END: FMC end of operation interrupt
      \arg        FMC_INT_ERR: FMC error interrupt
      \arg        FMC_INT_RPERR: read protection error interrupt
    \param[out] none
    \retval     none
*/
void fmc_interrupt_disable(uint32_t interrupt)
{
    FMC_CTL &= ~(interrupt & FMC_INTERRUPT_CFG_MASK);
}

/*!
    \brief      get FMC interrupt flag (API_ID(0x0025U))
    \param[in]  flag: FMC interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        FMC_INT_FLAG_END: FMC end of operation interrupt flag
      \arg        FMC_INT_FLAG_OPRERR: FMC error interrupt flag
      \arg        FMC_INT_FLAG_RPERR: read protection error interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus fmc_interrupt_flag_get(uint32_t flag)
{
    FlagStatus status = RESET;

    flag &= FMC_INTERRUPT_FLAG_MASK;
    
    if(0U!=(FMC_STAT & flag)) {
        status = SET;
    }
    /* return the state of corresponding FMC flag */
    return status;
}

